###################################################################

# Created by write_sdc on Fri Apr  4 04:04:53 2014

###################################################################
set sdc_version 1.8

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current uA
create_clock -name vclk  -period 10  -waveform {0 5}
set_input_delay 0  [get_ports {A[7]}]
set_input_delay 0  [get_ports {A[6]}]
set_input_delay 0  [get_ports {A[5]}]
set_input_delay 0  [get_ports {A[4]}]
set_input_delay 0  [get_ports {A[3]}]
set_input_delay 0  [get_ports {A[2]}]
set_input_delay 0  [get_ports {A[1]}]
set_input_delay 0  [get_ports {A[0]}]
set_input_delay 0  [get_ports {B[7]}]
set_input_delay 0  [get_ports {B[6]}]
set_input_delay 0  [get_ports {B[5]}]
set_input_delay 0  [get_ports {B[4]}]
set_input_delay 0  [get_ports {B[3]}]
set_input_delay 0  [get_ports {B[2]}]
set_input_delay 0  [get_ports {B[1]}]
set_input_delay 0  [get_ports {B[0]}]
set_input_delay 0  [get_ports Cin]
set_output_delay 0  [get_ports {Sum[7]}]
set_output_delay 0  [get_ports {Sum[6]}]
set_output_delay 0  [get_ports {Sum[5]}]
set_output_delay 0  [get_ports {Sum[4]}]
set_output_delay 0  [get_ports {Sum[3]}]
set_output_delay 0  [get_ports {Sum[2]}]
set_output_delay 0  [get_ports {Sum[1]}]
set_output_delay 0  [get_ports {Sum[0]}]
set_output_delay 0  [get_ports Cout]
set_output_delay 0  [get_ports {AxorB_out[7]}]
set_output_delay 0  [get_ports {AxorB_out[6]}]
set_output_delay 0  [get_ports {AxorB_out[5]}]
set_output_delay 0  [get_ports {AxorB_out[4]}]
set_output_delay 0  [get_ports {AxorB_out[3]}]
set_output_delay 0  [get_ports {AxorB_out[2]}]
set_output_delay 0  [get_ports {AxorB_out[1]}]
set_output_delay 0  [get_ports {AxorB_out[0]}]
set_output_delay 0  [get_ports {AandB_out[7]}]
set_output_delay 0  [get_ports {AandB_out[6]}]
set_output_delay 0  [get_ports {AandB_out[5]}]
set_output_delay 0  [get_ports {AandB_out[4]}]
set_output_delay 0  [get_ports {AandB_out[3]}]
set_output_delay 0  [get_ports {AandB_out[2]}]
set_output_delay 0  [get_ports {AandB_out[1]}]
set_output_delay 0  [get_ports {AandB_out[0]}]
set_output_delay 0  [get_ports {PandCin_out[7]}]
set_output_delay 0  [get_ports {PandCin_out[6]}]
set_output_delay 0  [get_ports {PandCin_out[5]}]
set_output_delay 0  [get_ports {PandCin_out[4]}]
set_output_delay 0  [get_ports {PandCin_out[3]}]
set_output_delay 0  [get_ports {PandCin_out[2]}]
set_output_delay 0  [get_ports {PandCin_out[1]}]
set_output_delay 0  [get_ports {PandCin_out[0]}]
set_output_delay 0  [get_ports {Cin_out[7]}]
set_output_delay 0  [get_ports {Cin_out[6]}]
set_output_delay 0  [get_ports {Cin_out[5]}]
set_output_delay 0  [get_ports {Cin_out[4]}]
set_output_delay 0  [get_ports {Cin_out[3]}]
set_output_delay 0  [get_ports {Cin_out[2]}]
set_output_delay 0  [get_ports {Cin_out[1]}]
set_output_delay 0  [get_ports {Cin_out[0]}]
